2-CaseFiles/case22/general/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (-1 -1 0) //0
    (1 -1 0) //1
    (1 1 0) //2
    (-1 1 0) //3
    (-0.25 -0.25 0) //4
    (0.25 -0.25 0) //5
    (0.25 0.25  0) //6
    (-0.25 0.25 0) //7
    (-1 -1 4) //8
    (1 -1 4) //9
    (1 1 4) //10
    (-1 1 4) //11
    (-0.25 -0.25 4) //12
    (0.25 -0.25 4) //13
    (0.25 0.25  4) //14
    (-0.25 0.25 4) //15
    (-0.25 -0.25 -2) //16
    (0.25 -0.25 -2) //17
    (0.25 0.25  -2) //18
    (-0.25 0.25 -2) //19
);

blocks
(
    hex (0 1 5 4 8 9 13 12) (5 4 15) simpleGrading (1 1 1) //B0
    hex (5 1 2 6 13 9 10 14) (4 5 15) simpleGrading (1 1 1) //B1
    hex (7 6 2 3 15 14 10 11) (5 4 15) simpleGrading (1 1 1) //B2
    hex (0 4 7 3 8 12 15 11) (4 5 15) simpleGrading (1 1 1) //B3
    hex (4 5 6 7 12 13 14 15) (5 5 15) simpleGrading (1 1 1) //B4
    hex (16 17 18 19 4 5 6 7) (5 5 10) simpleGrading (1 1 1) //B5
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (16 17 18 19)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 13 12)
            (13 9 10 14)
            (15 14 10 11)
            (8 12 15 11)
            (12 13 14 15)
        );
    }
    tube
    {
        type wall;
        faces
        (
            (16 17 5 4)
            (17 18 6 5)
            (19 7 6 18)
            (19 16 4 7)
        );
    }
    tank
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (5 1 2 6)
            (7 6 2 3)
            (0 4 7 3)
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (3 0 8 11)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
