2-CaseFiles/case22/general/system/xblockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

parameters
(
    x = 2; // Define x parameter
    y = 2; // Define y parameter
    z = 4; // Define z parameter
    x_4 = $x / 4; // Pre-calculate x/4
    y_4 = $y / 4; // Pre-calculate y/4
    z_2 = $z / 2; // Pre-calculate z/2
);

vertices
(
    (-$x -$y 0) //0
    ($x -$y 0) //1
    ($x $y 0) //2
    (-$x $y 0) //3
    (-$x_4 -$y_4 0) //4
    ($x_4 -$y_4 0) //5
    ($x_4 $y_4  0) //6
    (-$x_4 $y_4 0) //7
    (-$x -$y $z) //8
    ($x -$y $z) //9
    ($x $y $z) //10
    (-$x $y $z) //11
    (-$x_4 -$y_4 $z) //12
    ($x_4 -$y_4 $z) //13
    ($x_4 $y_4  $z) //14
    (-$x_4 $y_4 $z) //15
    (-$x_4 -$y_4 -$z_2) //16
    ($x_4 -$y_4 -$z_2) //17
    ($x_4 $y_4  -$z_2) //18
    (-$x_4 $y_4 -$z_2) //19
);

blocks
(
    hex (0 1 5 4 8 9 13 12) (5 4 15) simpleGrading (1 1 1) //B0
    hex (5 1 2 6 13 9 10 14) (4 5 15) simpleGrading (1 1 1) //B1
    hex (7 6 2 3 15 14 10 11) (5 4 15) simpleGrading (1 1 1) //B2
    hex (0 4 7 3 8 12 15 11) (4 5 15) simpleGrading (1 1 1) //B3
    hex (4 5 6 7 12 13 14 15) (5 5 15) simpleGrading (1 1 1) //B4
    hex (16 17 18 19 4 5 6 7) (5 5 10) simpleGrading (1 1 1) //B5
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (16 17 18 19)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 13 12)
            (13 9 10 14)
            (15 14 10 11)
            (8 12 15 11)
            (12 13 14 15)
        );
    }
    tube
    {
        type wall;
        faces
        (
            (16 17 5 4)
            (17 18 6 5)
            (19 7 6 18)
            (19 16 4 7)
        );
    }
    tank
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (5 1 2 6)
            (7 6 2 3)
            (0 4 7 3)
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (3 0 8 11)
        );
    }

);

mergePatchPairs
(
);
// ************************************************************************* //
